In [8]:
import pandas as pd

In [9]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [10]:
import pandas as pd
df=pd.read_csv('/content/drive/MyDrive/Copy of Titanic-Dataset.csv')

In [11]:
print(df)

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]

In [12]:
titanic = pd.read_csv('/content/drive/MyDrive/Copy of Titanic-Dataset.csv')

In [13]:
fare=titanic[['Fare']]

In [14]:
print(fare.head())

      Fare
0   7.2500
1  71.2833
2   7.9250
3  53.1000
4   8.0500

In [15]:
class_age=df[['Pclass','Age']]
print(class_age.head())

   Pclass   Age
0       3  22.0
1       1  38.0
2       3  26.0
3       1  35.0
4       3  35.0

In [16]:
survived_gender=df[['Survived','Sex']]
print(survived_gender.head())

   Survived     Sex
0         0    male
1         1  female
2         1  female
3         1  female
4         0    male

In [17]:
fare_gt_100=df[df['Fare']>100]
print(fare_gt_100.head())

     PassengerId  Survived  Pclass  \
27            28         0       1
31            32         1       1
88            89         1       1
118          119         0       1
195          196         1       1

                                               Name     Sex   Age  SibSp  \
27                   Fortune, Mr. Charles Alexander    male  19.0      3
31   Spencer, Mrs. William Augustus (Marie Eugenie)  female   NaN      1
88                       Fortune, Miss. Mabel Helen  female  23.0      3
118                        Baxter, Mr. Quigg Edmond    male  24.0      0
195                            Lurette, Miss. Elise  female  58.0      0

     Parch    Ticket      Fare        Cabin Embarked
27       2     19950  263.0000  C23 C25 C27        S
31       0  PC 17569  146.5208          B78        C
88       2     19950  263.0000  C23 C25 C27        S
118      1  PC 17558  247.5208      B58 B60        C
195      0  PC 17569  146.5208          B80        C

In [18]:
first_class=df[df['Pclass']==1]
print(first_class.head())

    PassengerId  Survived  Pclass  \
1             2         1       1
3             4         1       1
6             7         0       1
11           12         1       1
23           24         1       1

                                                 Name     Sex   Age  SibSp  \
1   Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
3        Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
6                             McCarthy, Mr. Timothy J    male  54.0      0
11                           Bonnell, Miss. Elizabeth  female  58.0      0
23                       Sloper, Mr. William Thompson    male  28.0      0

    Parch    Ticket     Fare Cabin Embarked
1       0  PC 17599  71.2833   C85        C
3       0    113803  53.1000  C123        S
6       0     17463  51.8625   E46        S
11      0    113783  26.5500  C103        S
23      0    113788  35.5000    A6        S

In [19]:
female_under_18=df[(df['Sex']=='female')&(df['Age']<18)]
print(female_under_18.head())

    PassengerId  Survived  Pclass                                  Name  \
9            10         1       2   Nasser, Mrs. Nicholas (Adele Achem)
10           11         1       3       Sandstrom, Miss. Marguerite Rut
14           15         0       3  Vestrom, Miss. Hulda Amanda Adolfina
22           23         1       3           McGowan, Miss. Anna "Annie"
24           25         0       3         Palsson, Miss. Torborg Danira

       Sex   Age  SibSp  Parch   Ticket     Fare Cabin Embarked
9   female  14.0      1      0   237736  30.0708   NaN        C
10  female   4.0      1      1  PP 9549  16.7000    G6        S
14  female  14.0      0      0   350406   7.8542   NaN        S
22  female  15.0      0      0   330923   8.0292   NaN        Q
24  female   8.0      3      1   349909  21.0750   NaN        S

In [20]:
embarked_c_s=df[(df['Embarked']=='C')|(df['Embarked']=='S')]
print(embarked_c_s.head())

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S

In [21]:
first_second_class = df[df['Pclass'].isin([1, 2])]
print(first_second_class.head())

    PassengerId  Survived  Pclass  \
1             2         1       1
3             4         1       1
6             7         0       1
9            10         1       2
11           12         1       1

                                                 Name     Sex   Age  SibSp  \
1   Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
3        Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
6                             McCarthy, Mr. Timothy J    male  54.0      0
9                 Nasser, Mrs. Nicholas (Adele Achem)  female  14.0      1
11                           Bonnell, Miss. Elizabeth  female  58.0      0

    Parch    Ticket     Fare Cabin Embarked
1       0  PC 17599  71.2833   C85        C
3       0    113803  53.1000  C123        S
6       0     17463  51.8625   E46        S
9       0    237736  30.0708   NaN        C
11      0    113783  26.5500  C103        S

In [22]:
df['Age'] = df['Age'].fillna(df['Age'].median())

In [23]:
df['fare_per_year'] = df['Fare'] / df['Age']

In [24]:
high_fare_age=df[df['fare_per_year']>5]

In [26]:
high_fare_age=high_fare_age.sort_values(by='fare_per_year',ascending=False)

In [29]:
result = high_fare_age[['Name','fare_per_year']] # Changed high_fare_age_srt to high_fare_age
print(result.head())

                                Name  fare_per_year
305   Allison, Master. Hudson Trevor     164.728261
297     Allison, Miss. Helen Loraine      75.775000
386  Goodwin, Master. Sidney Leonard      46.900000
164     Panula, Master. Eino Viljami      39.687500
183        Becker, Master. Richard F      39.000000

In [31]:
df['fare_per_class']=df['Fare']/df['Pclass']
adult_males = df[(df['Age'] >= 18) & (df['Sex'] == 'male')]
adult_males_srt = adult_males.sort_values(by='fare_per_class', ascending=False)

In [32]:
result = adult_males_srt[['Name', 'Age', 'fare_per_class']]
print(result.head())

                                   Name   Age  fare_per_class
737              Lesurer, Mr. Gustave J  35.0        512.3292
679  Cardeza, Mr. Thomas Drake Martinez  36.0        512.3292
438                   Fortune, Mr. Mark  64.0        263.0000
27       Fortune, Mr. Charles Alexander  19.0        263.0000
118            Baxter, Mr. Quigg Edmond  24.0        247.5208

In [33]:
total_fare = df['Fare'].sum()
print(f"Total fare revenue: {total_fare}")

Total fare revenue: 28693.9493

In [34]:
fare_first_class = df[df['Pclass'] == 1]['Fare'].sum()
print(f"Total fare revenue for First Class: {fare_first_class}")

Total fare revenue for First Class: 18177.4125

In [35]:
fare_second_class = df[df['Pclass'] == 2]['Fare'].sum()
print(f"Total fare revenue for Second Class: {fare_second_class}")

Total fare revenue for Second Class: 3801.8417

In [36]:
fare_third_class = df[df['Pclass'] == 3]['Fare'].sum()
print(f"Total fare revenue for Third Class: {fare_third_class}")

Total fare revenue for Third Class: 6714.6951

In [37]:
class_fares = [fare_first_class, fare_second_class, fare_third_class]
print(f"Class fare totals: {class_fares}")

Class fare totals: [18177.4125, 3801.8417, 6714.6951]

In [39]:
fare_proportion = [fare / total_fare * 100 for fare in class_fares]
class_labels = ['First Class', 'Second Class', 'Third Class']
result = pd.DataFrame({
    'Class': class_labels,
    'Fare Proportion (%)': fare_proportion
})

print(result)

          Class  Fare Proportion (%)
0   First Class            63.349288
1  Second Class            13.249629
2   Third Class            23.401084

In [41]:
def categorize_age(age):
    if age < 18:
        return 'child'
    elif age >= 18 and age < 65:
        return 'adult'
    else:
        return 'senior'

df['age_group'] = df['Age'].apply(categorize_age)
print(df[['Age', 'age_group']].head())

    Age age_group
0  22.0     adult
1  38.0     adult
2  26.0     adult
3  35.0     adult
4  35.0     adult

In [42]:
total_passengers = len(df)
print(f"Total number of passengers: {total_passengers}")

Total number of passengers: 891

In [43]:
age_group_counts = df['age_group'].value_counts()
print(age_group_counts)

age_group
adult     767
child     113
senior     11
Name: count, dtype: int64

In [44]:
age_group_proportions = (age_group_counts / total_passengers) * 100
print(age_group_proportions)

age_group
adult     86.083053
child     12.682379
senior     1.234568
Name: count, dtype: float64

In [46]:
age_group_result = pd.DataFrame({
    'Age Group': age_group_proportions.index,
    'Proportion of Passenger (%)': age_group_proportions.values
})

In [47]:
print(age_group_result)

  Age Group  Proportion of Passenger (%)
0     adult                    86.083053
1     child                    12.682379
2    senior                     1.234568